import React, { useState } from 'react'
import ReactQuill from 'react-quill';
import 'react-quill/dist/quill.snow.css';

const DebateCompetition = () => {

  const [text, setText] = useState('');

  const handleChange = (value) => {
    setText(value);
  };


  const DebateCompetition = [
    "বিতর্ক প্রতিযোগিতা একটি মূল্যমূলক দক্ষতা প্রদর্শন প্রতিস্পর্ধা, যেখানে প্রতিযোগীদের তর্ক, তর্কবিতর্ক, এবং বিচারের ক্ষমতা মূল্যাংকন করা হয়। এই প্রতিস্পর্ধার উদ্দেশ্য হল তার মূল মেটানো বা মূল্যাঙ্কন করা, এবং এটি প্রতিস্পর্ধীদের তর্কের দক্ষতা এবং তাদের তর্ক প্রস্তুতি বৃদ্ধি দেয়। বিতর্ক প্রতিযোগিতা প্রতিস্পর্ধীদের মাধ্যমে যে বিষয়গুলি উত্থান করতে হয়, তা সাধারণভাবে সাক্ষरতা, তর্ক ক্ষমতা, সাক্ষরতা, বিজ্ঞান, সামাজিক বিষয়ের বিচার, এবং তর্কবিতর্কের বিষয়ে সংকোচক এবং সবল মাধ্যমে উপস্থাপন করা হয়। বিতর্ক প্রতিযোগিতা আমাদের তর্কের দক্ষতা, যোগাযোগের ক্ষমতা, এবং তার সাথে তর্কিত এবং সুন্দর ভাবে বলার ক্ষমতা উন্নত করতে সাহায্য করে। এই প্রতিযোগিতা অধ্যাপন করে, সমাজে তর্কবিতর্কের প্রয়োজনীয়তা এবং তর্ক বিতর্কের মূল্যমূলক স্থান অনুমোদন করা হয়। এটি প্রতিস্পর্ধীদের মানবিক উন্নতি এবং অধিক জ্ঞানগত উন্নতির সাথে তাদের স্বপ্ন এবং লক্ষ্য অর্জন করতে সাহায্য করে। বিতর্ক প্রতিযোগিতা একটি শিক্ষামূলক প্রক্রিয়া, যেখানে প্রতিযোগীগণ একে অপরকে পরামর্শ, তর্ক, এবং নিজের মতামত প্রকট করে তাদের দক্ষতা দেখাতে পারে। এই প্রতিযোগিতা প্রতিটি প্রতিযোগীর জন্য নতুন দৃষ্টিভঙ্গি এবং নতুন ধারণা নির্মাণ করে। প্রতিস্পর্ধীদের মধ্যে তর্ক এবং মূল্যমূলক প্রতিবাদের মাধ্যমে তাদের মতামত প্রকট করার দক্ষতা উন্নত হয় এবং আলোচনা করার ক্ষমতা বৃদ্ধি পায়। এই প্রতিযোগিতা আমাদের মধ্যে সামাজিক বিষয়, রাষ্ট্রীয় এবং আন্তর্জাতিক সামাজিক বিষয়, পরিবেশ সংরক্ষণ, রাজনীতি, প্রযুক্তি ইত্যাদি সম্পর্কে মূল্যায়ন করার সুযোগ প্রদান করে। এই প্রতিযোগিতা প্রতিযোগীদের মধ্যে টীম পরিচিতি, সম্পর্ক তৈরি, গবেষণা এবং বিশ্লেষণের ক্ষমতা উন্নত করে তাদের ক্যারিয়ার জন্য প্রস্তুত করে। এটি বৃদ্ধি করে তাদের প্রশাসনিক ক্ষমতা, দৃষ্টিভঙ্গি, আত্মবিশ্বাস, এবং প্রযুক্তিগত দক্ষতা, যা তাদের পেশাদার জীবনে উন্নতির পথে সাহায্য করে। এই প্রতিযোগিতা সমাজে নতুন নতুন উদ্যোগ আদান-প্রদান করার প্রেরণা দেয় এবং যুগের প্রয়োজনীয় দক্ষতা এবং জ্ঞানে প্রয়োজন প্রদান করে। বিতর্ক প্রতিযোগিতা একটি মহান প্ল্যাটফর্ম, যেখানে বিভিন্ন বিষয়ে গভীর আলোচনা এবং তর্কবিতর্ক করার মাধ্যমে জ্ঞান ও প্রতিভা পরিক্ষা করা হয়। এই প্রতিযোগিতা প্রতিযোগীদের জ্ঞান, বক্তৃতা, লেখাপড়া, অভিপ্রেততা, সমাজচিন্তা এবং পরিষ্কার ভাবে প্রকাশ করার জন্য একটি অদ্বিতীয় সুযোগ প্রদান করে। এই প্রতিযোগিতা প্রতিযোগীদের আলোচনাশীলতা, তর্কবিতর্কের দক্ষতা এবং লোকজন সামাজিক প্রস্থান সম্পর্কে মৌলিক জ্ঞান অর্জন করার সুযোগ প্রদান করে। এই প্রতিযোগিতা তর্কবিতর্কের মাধ্যমে বিভিন্ন দৃষ্টিভঙ্গি এবং ভিন্ন ভিন্ন মতামতের সম্মুখীন হতে সাহায্য করে, যা আমাদের সমাজে গভীরভাবে নতুন চিন্তাভাবনা এবং দৃষ্টিকোন নিয়ে আলোচনা করতে সাহায্য করে। এই প্রতিযোগিতা বিভিন্ন বিষয়ে নতুন নতুন প্রস্তাবনা এবং তাজা ধারণা জমা দেওয়ার জন্য একটি মাধ্যম হিসেবে কাজ করে, যা শিক্ষার্থীদের আলোচনাশীলতা এবং বিশ্লেষণ ক্ষমতা বৃদ্ধি দেয় এবং তাদের প্রশাসনিক ও দায়িত্বের দক্ষতা উন্নত করে। এই প্রতিযোগিতা সমাজে নতুন নতুন দৃষ্টিভঙ্গি এবং ভিন্ন ভিন্ন মতামতের মধ্যে আলোচনার প্রয়োজনীয়তা এবং তর্ক বিতর্কের মূল্যমূলক স্থান অনুমোদন করা হয়। এটি প্রতিযোগীদের মানবিক উন্নতি এবং অধিক জ্ঞানগত উন্নতির সাথে তাদের স্বপ্ন এবং লক্ষ্য অর্জন করতে সাহায্য করে।"
  ]


  return (
    <React.Fragment>
      <div id="aboutUs" className='bg-[#FFFFFF80] '>
        <div className="aboutUS-title">
          <h3 className='bg-[#79929C] text-white font-medium text-md mt-4 py-4 pl-4'>বিতর্ক প্রতিযোগিতা</h3>
          {DebateCompetition.map((text, index) => (
            <li className='py-2 list-none mx-2' key={index}>
              <div className='currentNewsList my-2 flex justify-between flex-wrap'>
                <p>{text}</p>
                <button className='bg-[#CE5A67] text-white px-4 mt-2 py-1'>মুছুন</button>
              </div>
            </li>
          ))}

          <div className='my-4 flex flex-col mt-8 lg:ml-0 ml-2'>
            <h4 className='font-semibold text-lg underline'>নতুন সংযোগ করুন</h4>

            {/* Text Area to add news */}
            <div className=' my-10 '>
              <ReactQuill className='h-44' value={text} onChange={handleChange} />
            </div>

            <div className="mt-14 lg:mt-4 text-black">
            <button type="submit" className='bg-[#c5dfe77a] px-6 py-2 mb-2'>আপডেট করুন</button>
          </div>

          </div>
        </div>
      </div>
    </React.Fragment>
  )
}

export default DebateCompetition