import React, { useState } from 'react'
import ReactQuill from 'react-quill';
import 'react-quill/dist/quill.snow.css';

const AboutUs = () => {

  const [text, setText] = useState('');

  const handleChange = (value) => {
    setText(value);
  };


  const aboutUs = [
    "আমাদের স্কুল একটি গতিশীল এবং ব্যাপক শিক্ষা প্রতিষ্ঠান, যা একটি আদর্শ উপস্থিতিতে অবস্থিত আছে একটি আদর্শ উপনগরে। এটি একটি শান্তিপূর্ণ পরিবেশ প্রদান করে, যেখানে বিভিন্ন সংস্কৃতির ছাত্র-ছাত্রী শিক্ষার পথে অগ্রগতি করতে পারে। আমাদের শিক্ষক দল প্রতিশ্রুতিশীল এবং উচ্চ যোগ্যতাসম্পন্ন, যারা বিজ্ঞান থেকে শিল্প প্রস্থান পর্যন্ত বিভিন্ন শাখা সম্পর্কে সম্পূর্ণ জ্ঞান দেওয়ার চেষ্টা করে। আমাদের স্কুলটি আধুনিক সংস্থান যা সম্পূর্ণ উপাদানে প্রতিষ্ঠিত হলেও বিশেষ করে শিক্ষার্থীদের পুরস্কৃত করতে প্রদান করে, এটি নিরন্তর শিক্ষা লাভ করার জন্য অবদান রাখে। এটি পড়াশোনা ছাড়াও বিভিন্ন প্রকল্পে এক্টিভ থাকার সুযোগ দেয়, যার মাধ্যমে শিক্ষার্থীরা ক্লাসরুমের বাইরে তাদের প্রশ্নাবলি খুজতে পারে আমাদের শিক্ষার্থীদের নিরাপত্তা এবং ভালোবাসা গুরুত্বপূর্ণ, এবং আমাদের প্রতিবদ্ধ কর্মী একটি নিরাপত্তা এবং আদরের পরিবেশ তৈরি করতে কাজ করেন। এছাড়া, আমরা সমাজের সামগ্রিক প্রগতির জন্য ভাগ্য পরার্ধ শক্তি দেওয়ার জন্য প্রতিশ্রুতি করি, যা নৈতিকতা এবং জীবনজীবন শেখা প্রদান করতে পারে। আমাদের স্কুলটি যেহেতু একটি গতিশীল প্রতিষ্ঠান, তাই আমরা শিক্ষার সাথে সাথে তার সাথে মোটর কৌশল, ক্রিয়েটিভ শিল্প, সাংগঠনিক দক্ষতা, এবং পরিবেশে সামাজিক সদয় তৈরি করা যেতে চেষ্টা করে। আমাদের শিক্ষা দানের মূখ্য উদ্দেশ্য হলো আমাদের ছাত্র - ছাত্রীদের চিন্তা ক্ষমতা, সমাধানে দক্ষতা, এবং সমস্যা সমাধানের দক্ষতা উন্নত করা, যাতে তারা সমৃদ্ধ জীবনে সফল হতে পারে।    আমরা শিক্ষার্থীদের অগ্নিদগ্ধ শ্ক্ল নিয়ে গর্ব করি, এবং তাদের প্রশাসন তাদের স্বকীয় লক্ষ্যের দিকে এগিয়ে যাওয়ার জন্য সাথে থাকে। আমাদের শিক্ষকদের দায়িত্ব হলো শিক্ষার্থীদের প্রতিটি ক্ষণে উন্নত করার সাথে তাদের মেটানো যায় সম্পূর্ণ সহানুভূতি এবং সাহানুভূতি সম্পর্কে। সমগ্রভাবে, আমরা আমাদের শিক্ষা প্রতিষ্ঠানে শিক্ষার জীবনমাধ্যমে আদর্শ এবং উন্নতির পথ প্রদান করার দিকে প্রতিশ্রুতিবদ্ধ, এবং আমরা সর্বদাই তাদের সাথে থাকতে উদ্দেশ্য করি।"
  ]


  return (
    <React.Fragment>
      <div id="aboutUs" className='bg-[#FFFFFF80] '>
        <div className="aboutUS-title">
          <h3 className='bg-[#79929C] text-white font-medium text-md mt-4 py-4 pl-4'>আমাদের কথা</h3>
          {aboutUs.map((text, index) => (
            <li className='py-2 list-none mx-2' key={index}>
              <div className='currentNewsList my-2 flex justify-between flex-wrap'>
                <p>{text}</p>
                <button className='bg-[#CE5A67] text-white px-4 mt-2 py-1'>মুছুন</button>
              </div>
            </li>
          ))}

          <div className='my-4 flex flex-col mt-8'>
            <h4 className='font-semibold text-lg underline'>নতুন সংযোগ করুন</h4>

            {/* Text Area to add news */}
            <div className=' my-10 '>
              <ReactQuill className='h-44' value={text} onChange={handleChange} />
            </div>

            <div className="mt-4 text-black">
            <button type="submit" className='bg-[#c5dfe77a] px-6 py-2 mb-2'>আপডেট করুন</button>
          </div>

          </div>
        </div>
      </div>
    </React.Fragment>
  )
}

export default AboutUs